export interface DocumentItem {
    id: number;
    title: string;
    type: string; 
}

export const documentList: DocumentItem[] = [
    { id: 1, title: "การตรวจตารางเปรียบเทียบอัตราส่วนและสูตรการผลิตน้ำมัน", type: "แบบ ภส. 05-02 ภส. 05-02/1 ภส. 07.01" },
    { id: 2, title: "ตรวจสอบตารางเปรียบเทียบการจ่ายวัตถุดิบกับปริมาณการผลิต และจำหน่าย เปรียบเทียบกับการชำระภาษี", type: "แบบ ภส. 07-01 ภส. 07-02 ภส. 03-07" },
    { id: 3, title: "แบบงบเดือนแสดงรายการวัตถุดิบ การผลิต การจำหน่าย และ ยอดคงเหลือสินค้า", type: "แบบ ภส. 07-04" },
    { id: 4, title: "ตรวจการทำบัญชีสิทธิ", type: "" },
    { id: 5, title: "ตรวจสอบปริมาณการขอลดหย่อนจำนวนเงินค่าภาษีสรรพสามิตที่ขอ ลดหย่อนชำระภาษีถูกต้องหรือไม่", type: "แบบ ภส. 03-07 ภส. 05-03" }
];
