export interface DocumentItem {
    id: string;
    title: string;
    description: string;
}

export const documents: DocumentItem[] = [
    {
        id: "ภส. 03-07",
        title: "แบบรายการภาษีสรรพสามิต ตามมาตรา 45(1)(4) และ 55",
        description: "บัญชีภาษีสรรพสามิต พ.ศ. 2560 (สำหรับผู้ประกอบอุตสาหกรรม)",
    },
    {
        id: "ภส. 05-03",
        title: "แบบคำขอหักลดหย่อนภาษีสรรพสามิตสำหรับวัตถุดิบ",
        description: "ตามมาตรา 105 แห่งพระราชบัญญัติภาษีสรรพสามิต พ.ศ. 2560",
    },
    {
        id: "ภส. 05-02",
        title: "แบบรายการภาษีสรรพสามิต ตามมาตรา 45(1)(4) และ 55",
        description: "บัญชีภาษีสรรพสามิต พ.ศ. 2560 (สำหรับผู้ประกอบอุตสาหกรรม)",
    },
    {
        id: "ภส. 07-04",
        title: "งบเดือนแสดงรายการเกี่ยวกับวัตถุดิบ การผลิต และยอดคงเหลือ",
        description: "บัญชีภาษีสรรพสามิต พ.ศ. 2560",
    },
    {
        id: "ภส. 07-01",
        title: "บัญชีประจำวันแสดงการจ่ายวัตถุดิบ ตามมาตรา 118",
        description: "บัญชีภาษีสรรพสามิต พ.ศ. 2560",
    },
];
